's
,
.
a
aardvark
about
abs
abulance
abusing
acoustic
across
added
adding
addresses
adds
adoring
adult
african
after
against
agitating
aiming
aimlessly
aims
air
airplane
airways
all
alligator
along
american
amount
an
and
anger
animal
animals
animated
ankle
another
ant
antenna
anti-freeze
apart
apollo
apple
applied
applies
applying
are
area
arena
arm
arms
around
arts
as
asian
asleep
assembling
astro
at
ate
attached
attacks
audience
automatic
away
axe
baby
back
backing
backs
backwards
bacon
badger
bag
bags
balancing
ball
ballerina
ballet
balling
bamboo
banana
band
banging
barbecue
barbell
barbells
barked
barking
baseball
basket
basketball
bath
bath-tub
bathing
bathtub
batman
batter
bays
beach
beak
beans
bear
bears
beating
beats
beauty
beaver
bed
beef
before
behind
being
bell
belly
bending
beside
between
bicycle
bicycles
bicyclists
big
bike
biker
bill
bin
bird
bites
biting
black
blades
blanket
blender
block
blocked
blocks
blow
blowing
blowtorch
blue
bmx
board
boarding
boards
boat
body
boiled
boiling
boils
bollywood
bomb
bonfire
bongo
book
booming
boot
bottle
bottles
bounces
bowl
bowling
box
boxer
boxing
boy
boys
braiding
branch
bread
breaded
breading
break
breaking
breaks
brick
bridge
broccoli
broke
broom
broth
brush
brushes
brushing
bug
bull
bullets
bun
bunch
bunny
burning
burrata
burrowing
bus
busting
butter
buttered
buttering
buttons
by
cabbage
cabinet
cage
cake
calendar
calender
call
camera
cameras
can
canoe
cantaloupe
capsicum
car
card
cards
caribou
carpet
carries
carrot
carrots
carrying
cartoon
carts
carving
castle
cat
catches
catching
cats
cattle
catwalk
cd
ceiling
celebrating
cell
cello
cement
cereal
chain
chair
chalk
chases
chasing
checking
checks
cheese
cheetah
chef
chess
chest
chewed
chewing
chicken
child
children
chili
chimp
chimpanzee
chop
chopped
chopper
chopping
chops
church
cigarette
cilantro
cinder
circle
circles
clarinet
classes
clay
cleaned
cleaner
cleaning
cleans
cleaver
cliff
climb
climbing
climbs
clip
close
closes
closet
clove
cloves
clown
club
coating
cob
coke
collecting
colored
combing
come
comedic
coming
communicating
compete
computer
concert
concrete
container
containing
contents
cook
cooked
cooker
cooking
cord
coriander
corn
cosmetics
costume
costumes
couch
cougar
could
counter
couple
couples
covers
cow
cowboy
cracked
cracking
cracks
crashes
crawled
crawling
crawls
cream
creature
creed
creek
cricket
crochet
crocodile
crossing
crowd
crushing
crying
cub
cubes
cucumber
cucumbers
cup
cupcake
curb
cut
cuts
cutting
cycling
cyclone
dance
danced
dancer
dances
dancing
dangling
dead
deboning
deep
deer
delivering
descaling
desert
desk
deveining
dices
dicing
did
dieing
different
digging
digital
diner
dips
dirt
dish
dishes
disk
dives
diving
doctor
doctors
does
dog
doggy
doghouse
dogs
doing
doll
dollar
donkey
door
doorway
dough
doused
down
downhill
dragged
dragging
dragon
draining
drawer
drawing
draws
drew
dried
dries
drill
drilled
drilling
drills
drinking
drinks
driven
drives
driving
drivong
drool
dropped
dropping
droppped
drops
drove
drum
drums
dry
duck
dummy
dumping
dunking
each
eagle
earth
eat
eating
eats
edge
egg
eggplant
eggs
elderly
electric
electronic
elephant
elephants
email
emery
empty
emptying
enclosed
end
erase
erased
erasing
escalator
escelator
event
exercise
exercises
exercising
exiting
exploded
explodes
explosion
eye
eyelid
eyeliner
eyes
eyeshadow
face
fall
falling
falls
fan
faucet
fed
feed
feeding
feeds
feet
fell
female
fence
ferret
ferrets
field
fighting
figure
figures
filing
filling
finding
finely
finger
fingernails
fingers
fire
fired
fires
firetruck
firing
fish
fished
fishes
fishing
fistfight
fistfighting
fitting
five
fixes
flag
flew
flies
flip
flipped
flipping
flips
float
floating
floor
flour
flouring
flower
flowers
flute
fly
flying
folding
folds
follow
followed
following
fondles
food
foods
football
for
fork
form
forth
fought
four
foxes
freezer
fridge
fried
friend
frog
frogs
from
front
fruit
frying
full
funny
furniture
game
gameboy
games
garage
garden
garland
garlic
garlics
gasoline
gate
gel
get
gets
getting
giant
gibbon
giggling
ginger
girl
girls
giving
glass
glasses
gloved
gloves
gnawing
goal
goes
going
golf
goo
gorilla
got
grabs
grand
grass
grates
grating
gray
grazed
grazing
greasing
greating
green
grilling
ground
group
guinea
guitar
guitars
gun
guns
guts
guy
hackysack
had
hair
haki
half
half-pipe
hallway
halter
hammer
hamster
hand
handgun
handheld
handling
hands
hanging
hangs
happily
hard
hardwood
hare
harp
hat
hay
he
head
heading
headphones
heavy
hedgehog
helicopter
helipad
helping
her
herb
herbs
herd
here
high
highway
hiking
hill
himself
his
hit
hitchhiking
hits
hitting
hoe
hold
holding
holds
hole
holes
hopping
hops
horse
hose
hot
hotel
house
how
huge
hugging
hunting
hurdles
hurting
in
inflatable
ingrediants
ingredients
inner
inside
insides
instrument
instruments
int
internet
interview
into
is
it
items
its
itself
jalepeno
jeep
jet
jetski
jogging
joker
jugs
juice
jump
jumped
jumping
jumps
jungle
kangaroo
kangroo
karaoke
karate
kept
kettle
key
key-board
keyboard
keyboards
kick
kicked
kicking
kicks
kid
kids
kill
kind
kiss
kissing
kitchen
kite
kitten
kittens
kneading
knife
knives
knocked
knocks
komodo
ladies
lady
lake
lamp
landing
lands
lane
language
laptop
large
laughed
laughing
lawn
lay
laying
lays
leader
leading
leaf
leak
leather
leave
leaves
leaving
lecture
leek
leg
legs
lemon
lemons
lemur
lense
letter
levitating
library
licking
licks
lid
lies
lifestyle
lifted
lifting
lifts
light
like
limb
line
liner
lion
lionel
lips
lipstick
liquid
lit
little
live
living
loading
loaf
loaves
log
logs
long
looking
looks
lori
loris
lorises
loses
lot
lying
machine
made
magazine
magic
make
make-up
makes
makeup
making
male
man
mandolin
maneuvering
mango
mans
marching
marsh
martial
masked
massage
mat
math
meal
measured
measures
measuring
meat
mechanical
medics
meditating
melon
melting
men
metal
mice
microphone
microwave
military
milk
mimes
mincing
missile
mix
mixed
mixer
mixes
mixing
mixture
mo-pad
models
monitor
monkey
mooing
moon-walking
moose
mother
motion
motor
motorcar
motorcycle
motorcyclist
motorcyle
motorized
mouse
mouth
moves
moving
mowing
mud
mug
mushrooms
music
musical
mustard
nail
nails
near
net
newspaper
noodles
noose
nose
not
nuclear
nunchucks
object
obstacles
ocean
octopus
of
off
office
officer
oil
okapi
okra
old
older
olive
on
one
onion
onions
onstage
onto
oots
open
opening
opens
operating
orange
orangutan
oriental
other
ouf
out
outside
oven
over
overweight
pacifier
pacing
package
packet
packing
paddle
paddling
paino
painting
pan
pancakes
panda
pandas
pankda
paper
papers
parking
parrot
partially
parts
passionately
pasta
paste
pasture
path
patient
patio
patting
paw
pawing
paws
peas
pecking
pecks
peddling
peeled
peeler
peeling
peels
pen
pencil
pencilling
penguins
people
pepper
pepperoni
peppers
perched
performed
performing
performs
perimeter
person
persons
pet
petted
petting
phone
piano
pianos
picked
picking
picks
picture
pictures
piece
pieces
pig
pilots
pineapple
pineapples
ping
pink
pipe
pistol
pitcher
pizza
pizzas
place
places
placing
plane
plant
plantain
plants
plastic
plate
platform
play
played
player
players
playing
plays
podium
poking
polar
pole
policewomen
pong
pony
pool
pooping
pops
pork
pot
potato
potatoe
potatoes
potatos
pots
pouncing
poured
pouring
pours
powder
powdering
power
practicing
pratices
prawn
praying
prepared
preparing
pressing
prey
processor
prone
protective
pudding
puddle
pull-ups
pulled
pulling
pulls
pumpkin
punching
puncturing
puppies
puppy
push
push-ups
pushed
pushes
pushing
pushups
put
puts
putting
quail
quickly
rabbi
rabbit
rabbits
raccoons
race
racers
racing
rack
racks
raft
railway
rain
ran
rapidly
rat
raw
read
reading
recruits
red
reels
refrigerator
relaxes
relaxing
removes
removing
repeatedly
resting
retrieves
reverse
revive
rhino
ribs
ric-a-roni
rice
richie
ride
rider
rides
riding
ridint
rifle
rihanna
rind
ring
ringers
rinsing
rises
rising
ritchie
river
road
robin
robot
robots
rock
rocket
rocks
rocky
rod
rode
roll
rolling
roni
roof
room
rooster
roosters
rope
rowing
rubbing
rubs
run
runners
running
runs
runway
rushes
sails
sak
salt
same
sand
sang
sapling
sat
sauce
saucer
sausages
sawing
say
scales
scaling
scallions
scallop
scared
scissors
scooter
scores
scrambles
scraping
scratched
scratches
scratching
screaming
screwing
scrubbing
sea
seadoo
seafood
seasoning
seasons
seat
seated
seeds
selling
serves
serving
set
sets
several
severs
sewing
shadow
shake
shaking
shallot
shappens
share
sharpening
sharpens
shaved
she
sheet
shelf
shimmied
shimp
shirt
shirtless
shiso
shoe
shooting
shoots
shopping
short
shot
shotgun
shoulder
shoulders
shower
showing
shown
shows
shredded
shredding
shreded
shrimp
shrimps
side
sidewalk
sign
silencer
sing
singing
sings
sink
sitiing
sitring
sits
sitting
skate
skateboard
skateboarder
skateboards
skating
skewered
skewers
skiing
skillet
skin
skipping
skit
skull
skunk
sky
slab
slabs
slam
slaps
slced
sledge
sledghammer
slice
sliced
slicer
slices
slicing
slide
slides
sliding
slime
slipping
slow
slowly
small
smashing
smearing
smelling
smeone
smoked
smoking
snake
sneezed
sniffing
snow
soccer
socializing
soda
solenodon
some
someoen
someone
something
song
sound
soup
south
space
spanked
spanks
speaker
speaking
speaks
speech
spices
spinning
spins
spitting
splashes
split
splits
spoon
spray
sprayed
spraying
sprays
spread
spreading
spreads
sprinkled
sprinkler
sprinkling
spun
square
squash
squeezing
squirrel
stabbing
stage
staircase
stairs
stand
standing
stared
stares
staring
starting
station
statue
steak
stealing
stenograph
stenographers
step
steps
stick
stickers
sticky
still
stirred
stirring
stirs
stone
store
storm
stove
straightening
straining
straw
street
streets
stretcher
strikes
striking
string
strip
strips
stroking
strumming
stuck
studies
stuffed
stuffing
stunts
styling
submarine
substance
sucker
sucking
sugar
suit
suitcases
sumo
sun
sunflowers
sunglasses
sunset
surf
surfing
swamp
swats
sweeping
swept
swim
swimmers
swimming
swims
swing
swinging
swings
sword
swung
t
t-shirt
table
tables
tail
take
takes
taking
talk
talked
talking
talks
tap
tape
tapping
target
tased
taxi
teams
tearing
teased
teasing
teenage
teenager
telephone
television
tennis
that
the
their
them
themselves
then
there
thick
thin
things
thinking
thinly
three
threw
through
throwing
throws
tiding
tied
ties
tiger
tight
tiles
tiny
tire
tires
to
toad
toaster
toddler
toe
tofu
together
toilet
tomato
tomatoe
tomatoes
tomatos
too
took
top
torching
tortila
tortilla
tortoise
tosses
touch
touched
touching
touchscreen
toward
towards
towel
towels
town
toy
toys
track
tracking
tractor
traffic
trail
train
trainer
trampoline
transport
trash
trashcan
traveling
tray
trays
treatment
tree
trees
trick
tricks
tricycle
tried
tries
trotted
truck
trumpet
trunk
trying
trys
tub
tube
tuber
tummy
tuna
turf
turning
turns
turtle
tv
twice
two
tying
typed
typing
ukulele
uncooked
under
underwater
up
ups
upset
upside
upside-down
used
uses
using
vacuuming
van
vase
vegetable
vegetables
vehicle
very
vice
video
violin
vodka
volleyballs
wading
wake
waking
walk
walked
walking
walks
wall
wallaby
walruses
was
washing
washington
waste
watching
water
water-tub
watermelon
waterskiing
wave
waves
waving
way
weapon
wearing
webcam
wedges
weight
weights
were
whacks
what
wheel
wheelies
while
whipping
whisk
whisked
whisking
white
who
wilderness
wind
window
windows
winds
wine
wipes
wiping
wire
with
wok
wolves
woman
women
wood
wooded
wooden
woods
work
working
wrapping
wrestling
writing
yard
yellow
yoga
you
young
youngster
zebras
zoo
zucchini
